In [1]:
import pandas as pd

In [3]:
print(pd.__version__)

1.5.2

In [5]:
arr=[0,1,2,3,4]
s1= pd.Series(arr)
print(s1)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [7]:
order=[1,2,3,4,5]
s2=pd.Series(arr,index=order)
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [9]:
import numpy as np
n=np.random.randn(5)
index=['a','b','c','d','e']
s2=pd.Series(n,index=index)
s2

a   -2.037664
b   -1.152258
c    0.864151
d    0.381330
e   -0.159421
dtype: float64

In [11]:
d={'a':1,'b':2,'c':3,'d':4,'e':5}
s3=pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
s1.index=['A','B','C','D','E']
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

# Slicing

In [16]:
print(s1[-2:])

D    3
E    4
dtype: int64

In [22]:
s4=pd.concat([s1,s3])
s4

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [24]:
s4.drop('e')

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
dtype: int64

In [25]:
s4

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
e    5
dtype: int64

# Series Operation

In [26]:
arr1=[1,2,3,4,5,6,7]
arr2=[6,7,8,9,5]

In [27]:
s5=pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [28]:
s6=pd.Series(arr1)
s6

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [29]:
s5.add(s6)

0     7.0
1     9.0
2    11.0
3    13.0
4    10.0
5     NaN
6     NaN
dtype: float64

In [30]:
s5.sub(s6)

0    5.0
1    5.0
2    5.0
3    5.0
4    0.0
5    NaN
6    NaN
dtype: float64

In [31]:
s5.mul(s6)

0     6.0
1    14.0
2    24.0
3    36.0
4    25.0
5     NaN
6     NaN
dtype: float64

In [32]:
s5.div(s6)

0    6.000000
1    3.500000
2    2.666667
3    2.250000
4    1.000000
5         NaN
6         NaN
dtype: float64

In [34]:
print("median",s6.median())
print("max",s6.max())
print("min",s6.min())

median 4.0
max 7
min 1

# Create Data Frame

In [6]:
dates=pd.date_range('today',periods=6)
dates

DatetimeIndex(['2023-05-01 09:59:19.158059', '2023-05-02 09:59:19.158059',
               '2023-05-03 09:59:19.158059', '2023-05-04 09:59:19.158059',
               '2023-05-05 09:59:19.158059', '2023-05-06 09:59:19.158059'],
              dtype='datetime64[ns]', freq='D')

In [38]:
num_arr=np.random.randn(6,4)
num_arr
columns=['A','B','C','D']

In [39]:
df1=pd.DataFrame(num_arr,index=dates,columns=columns)
df1

                                A         B         C         D
2023-03-18 10:17:14.159 -1.642170  0.606104  0.217661  0.737587
2023-03-19 10:17:14.159  0.247810  0.286627  0.079354 -0.535753
2023-03-20 10:17:14.159 -0.075049 -0.067213  1.777607  0.859844
2023-03-21 10:17:14.159  0.869193 -0.557785 -0.573985 -0.626133
2023-03-22 10:17:14.159 -0.498879 -0.124746 -0.405573  0.895927
2023-03-23 10:17:14.159  1.031991  0.387050  0.567951 -0.410086

In [41]:
data={'Animal':['cat','cat','dog','cat','dog','dog','cat','dog'],
      'age':[3.5,3,np.nan,2.4,1,np.nan,5,2],
      'visits':[1,2,3,4,5,3,2,1],
      'priority':['yes','no','no','yes','yes','no','yes','yes']}
labels=['a','b','c','d','e','f','g','h']

df2=pd.DataFrame(data,index=labels)
df2

  Animal  age  visits priority
a    cat  3.5       1      yes
b    cat  3.0       2       no
c    dog  NaN       3       no
d    cat  2.4       4      yes
e    dog  1.0       5      yes
f    dog  NaN       3       no
g    cat  5.0       2      yes
h    dog  2.0       1      yes

In [44]:
df2.dtypes

Animal       object
age         float64
visits        int64
priority     object
dtype: object

In [48]:
df3=df2.head(6)
df3

  Animal  age  visits priority
a    cat  3.5       1      yes
b    cat  3.0       2       no
c    dog  NaN       3       no
d    cat  2.4       4      yes
e    dog  1.0       5      yes
f    dog  NaN       3       no

In [49]:
df2.tail()

  Animal  age  visits priority
d    cat  2.4       4      yes
e    dog  1.0       5      yes
f    dog  NaN       3       no
g    cat  5.0       2      yes
h    dog  2.0       1      yes

In [50]:
df2.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'], dtype='object')

In [51]:
df2.columns

Index(['Animal', 'age', 'visits', 'priority'], dtype='object')

In [52]:
df2.values

array([['cat', 3.5, 1, 'yes'],
       ['cat', 3.0, 2, 'no'],
       ['dog', nan, 3, 'no'],
       ['cat', 2.4, 4, 'yes'],
       ['dog', 1.0, 5, 'yes'],
       ['dog', nan, 3, 'no'],
       ['cat', 5.0, 2, 'yes'],
       ['dog', 2.0, 1, 'yes']], dtype=object)

In [53]:
df2.describe()

            age    visits
count  6.000000  8.000000
mean   2.816667  2.625000
std    1.371739  1.407886
min    1.000000  1.000000
25%    2.100000  1.750000
50%    2.700000  2.500000
75%    3.375000  3.250000
max    5.000000  5.000000

In [56]:
df2.T

            a    b    c    d    e    f    g    h
Animal    cat  cat  dog  cat  dog  dog  cat  dog
age       3.5  3.0  NaN  2.4  1.0  NaN  5.0  2.0
visits      1    2    3    4    5    3    2    1
priority  yes   no   no  yes  yes   no  yes  yes

In [57]:
df2.sort_values(by='age')

  Animal  age  visits priority
e    dog  1.0       5      yes
h    dog  2.0       1      yes
d    cat  2.4       4      yes
b    cat  3.0       2       no
a    cat  3.5       1      yes
g    cat  5.0       2      yes
c    dog  NaN       3       no
f    dog  NaN       3       no

In [59]:
# Slicing Data Frame
df2[1:3]
df2.sort_values(by='age')[1:3]

  Animal  age  visits priority
h    dog  2.0       1      yes
d    cat  2.4       4      yes

In [60]:
df2[['age','visits']]

   age  visits
a  3.5       1
b  3.0       2
c  NaN       3
d  2.4       4
e  1.0       5
f  NaN       3
g  5.0       2
h  2.0       1

In [61]:
df2.iloc[1:3]

  Animal  age  visits priority
b    cat  3.0       2       no
c    dog  NaN       3       no

In [65]:
df3=df2.copy()

In [66]:
df3.isnull()

   Animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False   True   False     False
d   False  False   False     False
e   False  False   False     False
f   False   True   False     False
g   False  False   False     False
h   False  False   False     False

In [67]:
df3.loc['d','age']=2.0
df3

  Animal  age  visits priority
a    cat  3.5       1      yes
b    cat  3.0       2       no
c    dog  NaN       3       no
d    cat  2.0       4      yes
e    dog  1.0       5      yes
f    dog  NaN       3       no
g    cat  5.0       2      yes
h    dog  2.0       1      yes

In [69]:
df3.mean()

<ipython-input-69-e585dc5367fc>:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df3.mean()

age       2.750
visits    2.625
dtype: float64

In [70]:
df3['visits'].sum()

21

In [71]:
df3['visits'].min()

1

In [72]:
df3.sum()

Animal      catcatdogcatdogdogcatdog
age                             16.5
visits                            21
priority       yesnonoyesyesnoyesyes
dtype: object

In [76]:
string=pd.Series(['A','Cow','B','C','Dog',np.nan,'E',np.nan])
string.str.upper()

0      A
1    COW
2      B
3      C
4    DOG
5    NaN
6      E
7    NaN
dtype: object

# Operation on Data Frame for Missing Values

In [77]:
df4=df3.copy()
meanAge=df4['age'].mean()
df4.fillna(meanAge)

  Animal   age  visits priority
a    cat  3.50       1      yes
b    cat  3.00       2       no
c    dog  2.75       3       no
d    cat  2.00       4      yes
e    dog  1.00       5      yes
f    dog  2.75       3       no
g    cat  5.00       2      yes
h    dog  2.00       1      yes

In [79]:
df5=df3.copy()
df5.dropna(how='any')

  Animal  age  visits priority
a    cat  3.5       1      yes
b    cat  3.0       2       no
d    cat  2.0       4      yes
e    dog  1.0       5      yes
g    cat  5.0       2      yes
h    dog  2.0       1      yes

# Data Frame File Operation

In [80]:
df3.to_csv('animal.csv')

In [81]:
df_animal=pd.read_csv('animal.csv')
df_animal

  Unnamed: 0 Animal  age  visits priority
0          a    cat  3.5       1      yes
1          b    cat  3.0       2       no
2          c    dog  NaN       3       no
3          d    cat  2.0       4      yes
4          e    dog  1.0       5      yes
5          f    dog  NaN       3       no
6          g    cat  5.0       2      yes
7          h    dog  2.0       1      yes

In [ ]:
df3.to_excel('animal.xlsx',sheet_name='Sheet1')
df_animal2=pd.read_excel('animal.xlsx','Sheet1',index_col=none,na_values=['NA'])

In [ ]:
writer=pd.ExcelWriter('animal.xlsx')
df3.to_excel(writer,'df3')
writer.save()